name: "lstm_joints"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 100
      dim: 2
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 100
      dim: 2
    }
  }
  include: { phase: TEST }
}
layer {
  name: "label"
  type: "Input"
  top: "label"
  input_param {
    shape {
      dim: 100
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "label"
  type: "Input"
  top: "label"
  input_param {
    shape {
      dim: 100
    }
  }
  include: { phase: TEST }
}
layer {
  name: "h1"
  type: "InnerProduct"
  bottom: "data"
  top: "h1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu_h1"
  type: "ReLU"
  bottom: "h1"
  top: "h1"
}
layer {
  name: "drop_h1"
  type: "Dropout"
  bottom: "h1"
  top: "h1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "h2"
  type: "InnerProduct"
  bottom: "h1"
  top: "h2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu_h2"
  type: "ReLU"
  bottom: "h2"
  top: "h2"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "h2"
  top: "h2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "out"
  type: "InnerProduct"
  bottom: "h2"
  top: "out"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "out"
  bottom: "label"
  top: "loss"
}
layer {
  name: "probs"
  type: "Softmax"
  bottom: "out"
  top: "probs"
  include {
    phase: TEST
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "out"
  bottom: "label"
  top: "accuracy"
}

